IRP/src/Documents/ShipmentConfirmation/ShipmentConfirmation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ShipmentConfirmation</name>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitOutgoing</registerRecords>
  <registerRecords>AccumulationRegister.ShipmentOrders</registerRecords>
  <registerRecords>AccumulationRegister.ShipmentConfirmationSchedule</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ShipmentBasis</name>
      <type>
        <types>DefinedType.typeShipmentBasis</types>
      </type>
    </attributes>
    <attributes>
      <name>SerialLotNumber</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/ShipmentConfirmation/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load = True Then
		Return;
	EndIf;
	If DocumentsClientServer.DocumentBasedOnBoxingBundling(ThisObject, "ShipmentBasis") Then
		Partner = Undefined;
		LegalName = Undefined;
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
	
EndProcedure

Procedure UndoPosting(Cancel)
	
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "Boxing" Then
			Filling_BasedOn(FillingData);
		EndIf;
		
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "Bundling" Then
			Filling_BasedOn(FillingData);
		EndIf;
		
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "InventoryTransfer" Then
			Filling_BasedOn(FillingData);
		EndIf;
		
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "PurchaseReturn" Then
			Filling_BasedOn(FillingData);
		EndIf;
		
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "SalesInvoice" Then
			Filling_BasedOn(FillingData);
		EndIf;
		
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "SalesOrder" Then
			Filling_BasedOn(FillingData);
		EndIf;
		
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "Unboxing" Then
			Filling_BasedOn(FillingData);
		EndIf;
		
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "Unbundling" Then
			Filling_BasedOn(FillingData);
		EndIf;
	EndIf;
	
EndProcedure

Procedure Filling_BasedOn(FillingData)
	FillPropertyValues(ThisObject, FillingData, "Company, Partner, LegalName");
	For Each Row In FillingData.ItemList Do
		NewRow = ThisObject.ItemList.Add();
		FillPropertyValues(NewRow, Row);
		If Not ValueIsFilled(NewRow.Key) Then
			NewRow.Key = New UUID();
		EndIf;
		If ValueIsFilled(Row.Unit) And ValueIsFilled(Row.Unit.Quantity) Then
			NewRow.Quantity = Row.Quantity / Row.Unit.Quantity;
		EndIf;
	EndDo;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If DocumentsServer.CheckItemListStores(ThisObject) Then
		Cancel = True;	
	EndIf;
EndProcedure
